In [1]:
import pandas as pd

In [2]:
data = {
    'Store_ID': [1001, 1002, 1003, 1004, 1005],
    'Store_Name': ['Pet Paradise', 'Animal Kingdom', 'Furry Friends', 'Pet Pals', 'Fauna House'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Speciality': ['Fish', 'Birds', 'Dogs', 'Cats', 'Reptiles'],
    'Rating': [4.5, 4.2, 3.9, 4.7, 4.0]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     4.5
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### How would you replace all occurrences of 'New York' in the Location column with 'NYC'?

In [6]:
df.replace('New York', 'NYC')

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise          NYC       Fish     4.5
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### If you wanted to change ratings of 4.5 to 5, how would you use the replace method for this task?

In [11]:
df.loc[:, ['Rating']] = df.loc[:, ['Rating']].replace(4.5, 5)

In [12]:
df

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     5.0
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago       Dogs     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### How can you replace the speciality 'Dogs' with 'Canines' in the DataFrame?

In [13]:
df.loc[:, ['Speciality']] = df.loc[:, ['Speciality']].replace("Dogs", "Canines")

In [14]:
df

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    Pet Paradise     New York       Fish     5.0
1      1002  Animal Kingdom  Los Angeles      Birds     4.2
2      1003   Furry Friends      Chicago    Canines     3.9
3      1004        Pet Pals      Houston       Cats     4.7
4      1005     Fauna House      Phoenix   Reptiles     4.0

#### If you had a dictionary of old and new store names, how would you apply the replace method to update the store names in the DataFrame?

In [28]:
old_store_names = df.loc[:, 'Store_Name'].tolist()

In [29]:
old_store_names

['Pet Paradise', 'Animal Kingdom', 'Furry Friends', 'Pet Pals', 'Fauna House']

In [33]:
new_store_names = list(map(str.upper, old_store_names))

In [35]:
new_store_names

['PET PARADISE', 'ANIMAL KINGDOM', 'FURRY FRIENDS', 'PET PALS', 'FAUNA HOUSE']

In [39]:
name_dict = dict(zip(old_store_names, new_store_names))

In [40]:
name_dict

{'Pet Paradise': 'PET PARADISE',
 'Animal Kingdom': 'ANIMAL KINGDOM',
 'Furry Friends': 'FURRY FRIENDS',
 'Pet Pals': 'PET PALS',
 'Fauna House': 'FAUNA HOUSE'}

In [41]:
df.replace(to_replace={'Store_Name' : name_dict})

   Store_ID      Store_Name     Location Speciality  Rating
0      1001    PET PARADISE     New York       Fish     5.0
1      1002  ANIMAL KINGDOM  Los Angeles      Birds     4.2
2      1003   FURRY FRIENDS      Chicago    Canines     3.9
3      1004        PET PALS      Houston       Cats     4.7
4      1005     FAUNA HOUSE      Phoenix   Reptiles     4.0

#### How would you replace ratings below 4 with a string 'Low Rating'?

In [66]:
df_new = df.replace(to_replace=df.loc[df['Rating'] < 4.0].loc[:, 'Rating'].tolist(), value='Low Rating')

In [67]:
df_new

   Store_ID      Store_Name     Location Speciality      Rating
0      1001    Pet Paradise     New York       Fish         5.0
1      1002  Animal Kingdom  Los Angeles      Birds         4.2
2      1003   Furry Friends      Chicago    Canines  Low Rating
3      1004        Pet Pals      Houston       Cats         4.7
4      1005     Fauna House      Phoenix   Reptiles         4.0